'''Реализуйте класс стек. Класс должен иметь следующий функционал:
push - добавление элемента в стек
pop - удаление элемента из стека
измерение длины стека стандартным методом (функция len )
проверка вхождения объекта в стек
должна быть возможность итерироваться по стеку, получая следующий
элемент
строковое представление стека в формате q0<-q1<-q2<-q3<-q4<-... , где
q0 элемент на вершине стека
содержимое стека должно быть недоступно для редактирования извне
класса
'''
print(input().replace('1', 'one'))